app/controllers/authentics_controller.rb

  def index
    @authentics = Authentic.all
---
SELECT "authentics".* FROM "authentics"

  def edit
    if Authentic.find_by(id: params[:id], user_id: current_user.id)
---
SELECT "authentics".* FROM "authentics" WHERE "authentics"."id" = $1 AND "authentics"."user_id" = $2 LIMIT $3  [["id", 6], ["user_id", 1], ["LIMIT", 1]]

  def create
    # @authentic = Authentic.new(authentic_params.merge(user: current_user))
    @authentic = Authentic.new(Sneakers: authentic_params[:Sneakers], name: authentic_params[:name], description: authentic_params[:description], price: authentic_params[:price], availability: [:availability], category_id: authentic_params[:category_id], user: current_user)
    @authentic.photo.attach(authentic_params[:photo])
    respond_to do |format|
      if @authentic.save
---
INSERT INTO "authentics" ("Sneakers", "name", "description", "price", "availability", "user_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if  Authentic.find_by(id: params[:id], user_id: current_user.id)
          if @authentic.update(authentic_params)
---
SELECT "authentics".* FROM "authentics" WHERE "authentics"."id" = $1 AND "authentics"."user_id" = $2 LIMIT $3  [["id", 6], ["user_id", 1], ["LIMIT", 1]]
UPDATE "authentics" SET "name" = $1, "description" = $2, "price" = $3, "updated_at" = $4, "category_id" = $5 WHERE "authentics"."id" = $6

  def destroy
    if  Authentic.find_by(id: params[:id], user_id: current_user.id)
      @authentic.destroy
---
SELECT "authentics".* FROM "authentics" WHERE "authentics"."id" = $1 AND "authentics"."user_id" = $2 LIMIT $3  [["id", 7], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "authentics" WHERE "authentics"."id" = $1  [["id", 7]]

    def set_authentic
      @authentic = Authentic.find(params[:id])
---
SELECT "authentics".* FROM "authentics" WHERE "authentics"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def set_categories
      @categories=Category.all
---
SELECT "categories".* FROM "categories"