app/controllers/authentics_controller.rb

UPDATE "authentics" SET "updated_at" = $1 WHERE "authentics"."id" = $2  [["updated_at", "2021-05-25 04:38:23.105589"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @authentic.update(authentic_params)